In [1]:
%load_ext sql

In [2]:
%%sql duckdb://
CREATE TABLE people (name varchar(50), number int, country varchar(50));
INSERT INTO people VALUES ('joe', 82, 'usa');
INSERT INTO people VALUES ('paula', 93, 'uk');
INSERT INTO people VALUES ('sam', 77, 'canada');
INSERT INTO people VALUES ('emily', 65, 'usa');
INSERT INTO people VALUES ('michael', 89, 'usa');
INSERT INTO people VALUES ('sarah', 81, 'uk');
INSERT INTO people VALUES ('james', 76, 'usa');
INSERT INTO people VALUES ('angela', 88, 'usa');
INSERT INTO people VALUES ('robert', 82, 'usa');
INSERT INTO people VALUES ('lisa', 92, 'uk');
INSERT INTO people VALUES ('mark', 77, 'usa');
INSERT INTO people VALUES ('jennifer', 68, 'australia');

+-------+
| Count |
+-------+
+-------+

In [3]:
%%sql --save citizen
select * from people where country = 'usa'

Running query in 'duckdb://'

+---------+--------+---------+
|   name  | number | country |
+---------+--------+---------+
|   joe   |   82   |   usa   |
|  emily  |   65   |   usa   |
| michael |   89   |   usa   |
|  james  |   76   |   usa   |
|  angela |   88   |   usa   |
|  robert |   82   |   usa   |
|   mark  |   77   |   usa   |
+---------+--------+---------+

In [4]:
%sqlcmd profile -t citizen

+--------+------+---------+---------+
|        | name |  number | country |
+--------+------+---------+---------+
| count  |  7   |    7    |    7    |
| unique |  7   |    6    |    1    |
|  top   | joe  |   nan   |   usa   |
|  freq  |  1   |   nan   |    7    |
|  mean  | nan  | 79.8571 |   nan   |
|  std   | nan  |  7.5862 |   nan   |
|  min   | nan  |    65   |   nan   |
|  25%   | nan  | 76.0000 |   nan   |
|  50%   | nan  | 82.0000 |   nan   |
|  75%   | nan  | 88.0000 |   nan   |
|  max   | nan  |    89   |   nan   |
+--------+------+---------+---------+